fabienr/openbsd-bt/sbin/btconfig/btconfig.8
.\"	$OpenBSD$
.\"
.\" Copyright (c) 2020 Fabien Romano <fabien@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt BTCONFIG 8
.Os
.Sh NAME
.Nm btconfig
.Nd configure bluetooth controller and devices
.Sh SYNOPSIS
.Nm btconfig
.Op Fl v
.Oo
.Ar device
.Oo
.Ar command
.Op Ar parameter
.Oc
.Oc
.Sh DESCRIPTION
The
.Nm
utility is used to identify bluetooth controllers and devices and manager their
associations.
.sh EXAMPLES
XXX todo
.Sh SEE ALSO
.Xr bluetooth 4
.Sh HISTORY
The
.Nm
command appeared in
.Ox 6.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
command was written by
.An Fabien Romano Aq Mt fabien@openbsd.org .
